[PsiAmp_CV X2WeaponTemplate]
FriendlyName="Psi Underlay"
FriendlyNamePlural="Psi Underlays"
BriefSummary=""
TacticalText="<Bullet/> The Psi Underlay allows Psi Operatives to perform their Psionic abilities.\n<Bullet/> More advanced Psi Underlays can increase the Operative's Psionic strength, and the effectiveness of their abilities."
AbilityDescName="Psi Underlay"

[PsiAmp_MG X2WeaponTemplate]
FriendlyName="Advanced Psi Underlay"
FriendlyNamePlural="Advanced Psi Underlays"
BriefSummary="This evolved version of the Psi Underlay channels the user's Psionic energy far more clearly, enabling greater Psionic strength in our operatives. Psi Offense and Psionic attack damage of some abilities is improved when carrying this advanced amplifier."
TacticalText="<Bullet/> The Advanced Psi Underlay increases a Psi Operative's Psionic strength by +20.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.\n<Bullet/> The Advanced Psi Underlay also increases the damage done by many Psionic attacks.\n"
AbilityDescName="Psi Underlay"

[PsiAmp_BM X2WeaponTemplate]
FriendlyName="Alien Psi Underlay"
FriendlyNamePlural="Alien Psi Underlays"
BriefSummary="This version of the Psi Underlay incorporates artifacts from the powerful \"Gatekeeper\" alien we encountered. It will put our experienced Psi Operatives on the same level as the aliens' most powerful Psionic forces."
TacticalText="<Bullet/> The Psi Underlay increases a Psi Operative's Psionic strength by +40.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.<Bullet/> The Alien Psi Underlay also increases the damage done by many Psionic attacks.\n"
AbilityDescName="Psi Underlay"

[Psionics X2TechTemplate]
DisplayName="Psionics"
Summary="Although we've seen them wielding Psionic powers before, our recent encounters with the aliens have truly shown us how they are able to deftly manipulate the flow of Psionic energy and use it to their advantage. If we were to master it as well as they have, the potential applications in the field would be limitless."
CodeName="Geller"
LongDescription="By closely examining the aliens' own means of harnessing and wielding Psionic energy, I believe the chances are good that we'll have more than enough viable candidates to serve as Psi Operatives. However, with the advanced Psionic capabilities we've seen from the various alien species in the field, it may not be enough. In preparation for this new class of soldiers, I've used the chip removed from the Commander to study the technology needed to focus and divert Psionic energy. As a result, I've developed a Psionic amplifier underlay (P.A.U for short) capable of focusing and enhancing the Psionic energy they will be trained to harness. Although the potential for negative side effects will be high, I foresee the possibility that our soldiers will be able to push their new powers beyond the limits of what we might consider safe. R. Tygan."